CantileverBeam/concurrentGroundMotion/RunCase/OpenFOAMCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144;
        startFace       59830;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          144;
        startFace       59974;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          104;
        startFace       60118;
    }
    atmosphere
    {
        type            patch;
        nFaces          338;
        startFace       60222;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          330;
        startFace       60560;
    }
    defaultFaces
    {
        type            patch;
        nFaces          24144;
        startFace       60890;
    }
)

// ************************************************************************* //
